Revit 2026 API

# GlazingGlazingNoLevels Property

---

The property labeled "Sheets of Glass" from the "Glazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GlazingNoLevels { get; }
```
```vb
Public Shared ReadOnly Property GlazingNoLevels As String
	Get
```
```cpp
public:
static property String^ GlazingNoLevels {
	String^ get ();
}
```
```fsharp
static member GlazingNoLevels : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" within the range of "1, 6".

#### Reference

Glazing Class

Autodesk.Revit.DB.Visual Namespace